moag1000/ESP32-c5-Zigbee2ESPHome/main/zigbee/zb_install_codes.c
/**
 * @file zb_install_codes.c
 * @brief Zigbee Install Code Management Implementation
 *
 * Implements secure device joining using pre-configured install codes.
 * Install codes are validated with CRC-16/X-25 and converted to link keys
 * using HMAC-SHA-256 as specified in the Zigbee specification.
 *
 * @copyright Copyright (c) 2026
 * @license Apache License 2.0
 */

#include "zb_install_codes.h"
#include "zb_constants.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_idf_version.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "esp_mac.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "core/gateway_timeouts.h"
#include "core/memory/memory_manager_ng.h"
#include <string.h>
#include <time.h>
#include <ctype.h>
#include <inttypes.h>

/* ESP-IDF v6.0+ uses PSA Crypto API, v5.x uses legacy mbedTLS MD API */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#include "psa/crypto.h"
#define USE_PSA_CRYPTO 1
#else
#include "mbedtls/md.h"
#define USE_PSA_CRYPTO 0
#endif

static const char *TAG = "ZB_IC";

/* NVS namespace and keys */
#define NVS_NAMESPACE           "zb_ic"
#define NVS_KEY_COUNT           "count"
#define NVS_KEY_ENTRY_PREFIX    "ic_"

/* HMAC key for link key derivation (Zigbee specification) */
static const uint8_t HMAC_KEY[] = "ZigBeeAlliance09";
#define HMAC_KEY_LEN            16

/* CRC-16/X-25 polynomial and initial value */
#define CRC16_POLYNOMIAL        0x1021
#define CRC16_INIT              0xFFFF

/* Install code time-to-live (default: 30 days) */
#define ZB_INSTALL_CODE_TTL_SECONDS  (30 * 24 * 60 * 60)

/* Install code storage - allocated in PSRAM to save internal RAM */
static zb_install_code_entry_t *s_install_codes = NULL;
static size_t s_entry_count = 0;
static bool s_initialized = false;
static SemaphoreHandle_t s_mutex = NULL;

/* Forward declarations */
static esp_err_t load_from_nvs(void);
static esp_err_t save_to_nvs(void);
static esp_err_t save_entry_to_nvs(size_t index);
static int find_entry_index(uint64_t ieee_addr);
static int find_free_slot(void);

/* ============================================================================
 * CRC-16/X-25 Implementation
 * ============================================================================ */

/**
 * @brief Calculate CRC-16/X-25 checksum
 *
 * This is the CRC algorithm used for Zigbee install codes.
 * Polynomial: 0x1021 (x^16 + x^12 + x^5 + 1)
 * Initial value: 0xFFFF
 * Input/Output reflection: Yes
 * Final XOR: 0xFFFF
 */
uint16_t zb_install_codes_calculate_crc(const uint8_t *data, size_t len)
{
    uint16_t crc = CRC16_INIT;

    for (size_t i = 0; i < len; i++) {
        crc ^= (uint16_t)data[i];
        for (int j = 0; j < 8; j++) {
            if (crc & 0x0001) {
                crc = (crc >> 1) ^ 0x8408; /* Reflected polynomial */
            } else {
                crc >>= 1;
            }
        }
    }

    return crc ^ 0xFFFF;
}

/* ============================================================================
 * Link Key Derivation (HMAC-SHA-256)
 * ============================================================================ */

esp_err_t zb_install_codes_derive_key(const uint8_t *install_code, size_t code_len,
                                       uint8_t *out_key)
{
    if (install_code == NULL || out_key == NULL || code_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Use HMAC-SHA-256 with "ZigBeeAlliance09" as the key */
    uint8_t hmac_output[32]; /* SHA-256 produces 32 bytes */

#if USE_PSA_CRYPTO
    /* ESP-IDF v6.0+ uses PSA Crypto API */
    psa_status_t status;
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t key_id = 0;
    size_t output_len = 0;

    /* Initialize PSA Crypto if not already done */
    status = psa_crypto_init();
    if (status != PSA_SUCCESS && status != PSA_ERROR_ALREADY_EXISTS) {
        ESP_LOGE(TAG, "psa_crypto_init failed: %d", (int)status);
        return ESP_FAIL;
    }

    /* Set up key attributes for HMAC-SHA256 */
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_SIGN_MESSAGE);
    psa_set_key_algorithm(&attributes, PSA_ALG_HMAC(PSA_ALG_SHA_256));
    psa_set_key_type(&attributes, PSA_KEY_TYPE_HMAC);
    psa_set_key_bits(&attributes, HMAC_KEY_LEN * 8);

    /* Import the HMAC key */
    status = psa_import_key(&attributes, HMAC_KEY, HMAC_KEY_LEN, &key_id);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_import_key failed: %d", (int)status);
        return ESP_FAIL;
    }

    /* Compute HMAC */
    status = psa_mac_compute(key_id, PSA_ALG_HMAC(PSA_ALG_SHA_256),
                             install_code, code_len,
                             hmac_output, sizeof(hmac_output), &output_len);

    /* Always destroy the key after use */
    psa_destroy_key(key_id);

    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_mac_compute failed: %d", (int)status);
        return ESP_FAIL;
    }

#else
    /* ESP-IDF v5.x uses legacy mbedTLS MD API */
    mbedtls_md_context_t ctx;
    mbedtls_md_init(&ctx);

    int ret = mbedtls_md_setup(&ctx, mbedtls_md_info_from_type(MBEDTLS_MD_SHA256), 1);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_md_setup failed: %d", ret);
        mbedtls_md_free(&ctx);
        return ESP_FAIL;
    }

    ret = mbedtls_md_hmac_starts(&ctx, HMAC_KEY, HMAC_KEY_LEN);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_md_hmac_starts failed: %d", ret);
        mbedtls_md_free(&ctx);
        return ESP_FAIL;
    }

    ret = mbedtls_md_hmac_update(&ctx, install_code, code_len);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_md_hmac_update failed: %d", ret);
        mbedtls_md_free(&ctx);
        return ESP_FAIL;
    }

    ret = mbedtls_md_hmac_finish(&ctx, hmac_output);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_md_hmac_finish failed: %d", ret);
        mbedtls_md_free(&ctx);
        return ESP_FAIL;
    }

    mbedtls_md_free(&ctx);
#endif

    /* Take first 16 bytes of HMAC-SHA-256 output as the link key */
    memcpy(out_key, hmac_output, ZB_INSTALL_CODE_KEY_LEN);

    /* Clear sensitive data */
    memset(hmac_output, 0, sizeof(hmac_output));

    return ESP_OK;
}

/* ============================================================================
 * Validation Functions
 * ============================================================================ */

zb_install_code_status_t zb_install_codes_validate(const uint8_t *install_code,
                                                    size_t code_len)
{
    if (install_code == NULL) {
        return ZB_INSTALL_CODE_STATUS_ERROR;
    }

    /* Check valid lengths: 8, 10, 14, or 18 bytes (including 2-byte CRC) */
    if (code_len != ZB_INSTALL_CODE_LEN_48_BIT &&
        code_len != ZB_INSTALL_CODE_LEN_64_BIT &&
        code_len != ZB_INSTALL_CODE_LEN_96_BIT &&
        code_len != ZB_INSTALL_CODE_LEN_128_BIT) {
        ESP_LOGW(TAG, "Invalid install code length: %d", code_len);
        return ZB_INSTALL_CODE_STATUS_INVALID_LENGTH;
    }

    /* Extract the CRC from the install code (last 2 bytes, little-endian) */
    uint16_t provided_crc = ((uint16_t)install_code[code_len - 1] << 8) |
                            ((uint16_t)install_code[code_len - 2]);

    /* Calculate CRC over the code (without the CRC bytes) */
    uint16_t calculated_crc = zb_install_codes_calculate_crc(install_code, code_len - 2);

    if (provided_crc != calculated_crc) {
        ESP_LOGW(TAG, "CRC mismatch: provided=0x%04X, calculated=0x%04X",
                 provided_crc, calculated_crc);
        return ZB_INSTALL_CODE_STATUS_CRC_ERROR;
    }

    return ZB_INSTALL_CODE_STATUS_OK;
}

/* ============================================================================
 * NVS Persistence Functions
 * ============================================================================ */

static esp_err_t load_from_nvs(void)
{
    nvs_handle_t nvs_handle;
    esp_err_t ret = nvs_open(NVS_NAMESPACE, NVS_READONLY, &nvs_handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGI(TAG, "No stored install codes found");
        return ESP_OK; /* No stored data is OK */
    }
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to open NVS: %s", esp_err_to_name(ret));
        return ret;
    }

    /* Read entry count */
    uint8_t count = 0;
    ret = nvs_get_u8(nvs_handle, NVS_KEY_COUNT, &count);
    if (ret != ESP_OK) {
        nvs_close(nvs_handle);
        return ESP_OK; /* No count = no entries */
    }

    if (count > ZB_INSTALL_CODE_MAX_ENTRIES) {
        count = ZB_INSTALL_CODE_MAX_ENTRIES;
    }

    ESP_LOGI(TAG, "Loading %d install codes from NVS", count);

    /* Read each entry */
    char key[16];
    for (size_t i = 0; i < count; i++) {
        snprintf(key, sizeof(key), "%s%d", NVS_KEY_ENTRY_PREFIX, (int)i);

        size_t required_size = sizeof(zb_install_code_entry_t);
        ret = nvs_get_blob(nvs_handle, key, &s_install_codes[i], &required_size);
        if (ret == ESP_OK && s_install_codes[i].is_active) {
            s_entry_count++;
            ESP_LOGD(TAG, "Loaded install code for 0x%016" PRIX64,
                     s_install_codes[i].ieee_addr);
        }
    }

    nvs_close(nvs_handle);
    ESP_LOGI(TAG, "Loaded %d active install codes", s_entry_count);
    return ESP_OK;
}

static esp_err_t save_to_nvs(void)
{
    nvs_handle_t nvs_handle;
    esp_err_t ret = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to open NVS for writing: %s", esp_err_to_name(ret));
        return ret;
    }

