moag1000/ESP32-c5-Zigbee2ESPHome/main/zigbee/zb_install_codes.c
    /* Count active entries */
    uint8_t active_count = 0;
    for (size_t i = 0; i < ZB_INSTALL_CODE_MAX_ENTRIES; i++) {
        if (s_install_codes[i].is_active) {
            active_count++;
        }
    }

    /* Save count */
    ret = nvs_set_u8(nvs_handle, NVS_KEY_COUNT, active_count);
    if (ret != ESP_OK) {
        nvs_close(nvs_handle);
        return ret;
    }

    /* Save each active entry */
    char key[16];
    size_t save_index = 0;
    for (size_t i = 0; i < ZB_INSTALL_CODE_MAX_ENTRIES && save_index < active_count; i++) {
        if (s_install_codes[i].is_active) {
            snprintf(key, sizeof(key), "%s%d", NVS_KEY_ENTRY_PREFIX, (int)save_index);
            ret = nvs_set_blob(nvs_handle, key, &s_install_codes[i],
                              sizeof(zb_install_code_entry_t));
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to save entry %d: %s", (int)i, esp_err_to_name(ret));
            }
            save_index++;
        }
    }

    ret = nvs_commit(nvs_handle);
    nvs_close(nvs_handle);

    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Saved %d install codes to NVS", active_count);
    }

    return ret;
}

static esp_err_t save_entry_to_nvs(size_t index)
{
    /* For simplicity, save all entries (could be optimized for single entry) */
    return save_to_nvs();
}

/* ============================================================================
 * Internal Helper Functions
 * ============================================================================ */

/**
 * @brief Check if an install code entry has expired
 *
 * @param entry Pointer to install code entry
 * @return true if expired or invalid, false if still valid
 */
static bool is_entry_expired(const zb_install_code_entry_t *entry)
{
    if (entry == NULL || !entry->is_active) {
        return true;
    }

    /* If timestamp is 0, entry was created before expiration was implemented */
    if (entry->added_timestamp == 0) {
        return false;  /* Don't expire legacy entries */
    }

    time_t now = time(NULL);
    if (now == (time_t)-1) {
        return false;  /* Time not available, don't expire */
    }

    return ((uint32_t)now - entry->added_timestamp) > ZB_INSTALL_CODE_TTL_SECONDS;
}

static int find_entry_index(uint64_t ieee_addr)
{
    for (size_t i = 0; i < ZB_INSTALL_CODE_MAX_ENTRIES; i++) {
        if (s_install_codes[i].is_active &&
            s_install_codes[i].ieee_addr == ieee_addr &&
            !is_entry_expired(&s_install_codes[i])) {
            return (int)i;
        }
    }
    return -1;
}

static int find_free_slot(void)
{
    for (size_t i = 0; i < ZB_INSTALL_CODE_MAX_ENTRIES; i++) {
        if (!s_install_codes[i].is_active) {
            return (int)i;
        }
    }
    return -1;
}

/* ============================================================================
 * Public API Implementation
 * ============================================================================ */

esp_err_t zb_install_codes_init(void)
{
    if (s_initialized) {
        ESP_LOGW(TAG, "Install codes module already initialized");
        return ESP_OK;
    }

    ESP_LOGI(TAG, "Initializing install codes module...");

    /* Create mutex for thread-safe cleanup operations */
    s_mutex = xSemaphoreCreateMutex();
    if (s_mutex == NULL) {
        ESP_LOGE(TAG, "Failed to create mutex");
        return ESP_ERR_NO_MEM;
    }

    /* Allocate install code storage in PSRAM (saves ~1.2KB internal RAM) */
    if (s_install_codes == NULL) {
        s_install_codes = mem_ng_calloc(ZB_INSTALL_CODE_MAX_ENTRIES,
                                         sizeof(zb_install_code_entry_t),
                                         MEM_CAP_PSRAM);
        if (!s_install_codes) {
            ESP_LOGW(TAG, "PSRAM alloc failed, falling back to internal RAM");
            s_install_codes = mem_ng_calloc(ZB_INSTALL_CODE_MAX_ENTRIES,
                                             sizeof(zb_install_code_entry_t),
                                             MEM_CAP_DEFAULT);
        }
        if (!s_install_codes) {
            ESP_LOGE(TAG, "Failed to allocate install code storage");
            vSemaphoreDelete(s_mutex);
            s_mutex = NULL;
            return ESP_ERR_NO_MEM;
        }
    } else {
        memset(s_install_codes, 0,
               ZB_INSTALL_CODE_MAX_ENTRIES * sizeof(zb_install_code_entry_t));
    }
    s_entry_count = 0;

    /* Load from NVS */
    esp_err_t ret = load_from_nvs();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to load install codes from NVS: %s", esp_err_to_name(ret));
        /* Continue anyway with empty storage */
    }

    s_initialized = true;
    ESP_LOGI(TAG, "Install codes module initialized with %d entries", s_entry_count);
    return ESP_OK;
}

esp_err_t zb_install_codes_deinit(void)
{
    if (!s_initialized) {
        return ESP_OK;
    }

    /* Clear sensitive data */
    memset(s_install_codes, 0, ZB_INSTALL_CODE_MAX_ENTRIES * sizeof(zb_install_code_entry_t));
    s_entry_count = 0;
    s_initialized = false;

    /* Delete mutex */
    if (s_mutex != NULL) {
        vSemaphoreDelete(s_mutex);
        s_mutex = NULL;
    }

    ESP_LOGI(TAG, "Install codes module deinitialized");
    return ESP_OK;
}

esp_err_t zb_install_codes_add(uint64_t ieee_addr, const uint8_t *install_code,
                                size_t code_len)
{
    if (!s_initialized) {
        return ESP_ERR_INVALID_STATE;
    }

    if (install_code == NULL || code_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Validate install code */
    zb_install_code_status_t status = zb_install_codes_validate(install_code, code_len);
    if (status == ZB_INSTALL_CODE_STATUS_INVALID_LENGTH) {
        ESP_LOGE(TAG, "Invalid install code length: %d", code_len);
        return ESP_ERR_INVALID_ARG;
    }
    if (status == ZB_INSTALL_CODE_STATUS_CRC_ERROR) {
        ESP_LOGE(TAG, "Install code CRC validation failed");
        return ESP_ERR_INVALID_CRC;
    }
    if (status != ZB_INSTALL_CODE_STATUS_OK) {
        return ESP_FAIL;
    }

    /* Check if entry already exists */
    int existing = find_entry_index(ieee_addr);
    if (existing >= 0) {
        ESP_LOGW(TAG, "Install code already exists for 0x%016" PRIX64 ", updating",
                 ieee_addr);
        /* Update existing entry */
        memcpy(s_install_codes[existing].install_code, install_code, code_len);
        s_install_codes[existing].install_code_len = code_len;
        s_install_codes[existing].added_timestamp = (uint32_t)time(NULL);

        /* Derive new key */
        esp_err_t ret = zb_install_codes_derive_key(install_code, code_len,
                                                     s_install_codes[existing].derived_key);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to derive link key");
            return ret;
        }

