moag1000/ESP32-c5-Zigbee2ESPHome/main/zigbee/zb_install_codes.c
        return save_entry_to_nvs((size_t)existing);
    }

    /* Find free slot */
    int slot = find_free_slot();
    if (slot < 0) {
        ESP_LOGE(TAG, "Install code storage full (%d entries)", ZB_INSTALL_CODE_MAX_ENTRIES);
        return ESP_ERR_NO_MEM;
    }

    /* Create new entry */
    zb_install_code_entry_t *entry = &s_install_codes[slot];
    memset(entry, 0, sizeof(zb_install_code_entry_t));

    entry->ieee_addr = ieee_addr;
    memcpy(entry->install_code, install_code, code_len);
    entry->install_code_len = code_len;
    entry->is_active = true;
    entry->added_timestamp = (uint32_t)time(NULL);

    /* Derive link key */
    esp_err_t ret = zb_install_codes_derive_key(install_code, code_len, entry->derived_key);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to derive link key");
        entry->is_active = false;
        return ret;
    }

    s_entry_count++;

    ESP_LOGI(TAG, "Added install code for 0x%016" PRIX64 " (slot %d, total %d)",
             ieee_addr, slot, s_entry_count);

    /* Log derived key for debugging (first 4 bytes only) */
    ESP_LOGD(TAG, "Derived key: %02X%02X%02X%02X...",
             entry->derived_key[0], entry->derived_key[1],
             entry->derived_key[2], entry->derived_key[3]);

    return save_entry_to_nvs((size_t)slot);
}

esp_err_t zb_install_codes_remove(uint64_t ieee_addr)
{
    if (!s_initialized) {
        return ESP_ERR_INVALID_STATE;
    }

    int index = find_entry_index(ieee_addr);
    if (index < 0) {
        ESP_LOGW(TAG, "No install code found for 0x%016" PRIX64, ieee_addr);
        return ESP_ERR_NOT_FOUND;
    }

    /* Clear entry */
    memset(&s_install_codes[index], 0, sizeof(zb_install_code_entry_t));
    s_entry_count--;

    ESP_LOGI(TAG, "Removed install code for 0x%016" PRIX64 " (total %d)",
             ieee_addr, s_entry_count);

    return save_to_nvs();
}

esp_err_t zb_install_codes_get_key(uint64_t ieee_addr, uint8_t *out_key)
{
    if (!s_initialized) {
        return ESP_ERR_INVALID_STATE;
    }

    if (out_key == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    int index = find_entry_index(ieee_addr);
    if (index < 0) {
        return ESP_ERR_NOT_FOUND;
    }

    memcpy(out_key, s_install_codes[index].derived_key, ZB_INSTALL_CODE_KEY_LEN);
    return ESP_OK;
}

bool zb_install_codes_has_entry(uint64_t ieee_addr)
{
    if (!s_initialized) {
        ESP_LOGD(TAG, "Install codes module not initialized");
        return false;
    }
    return find_entry_index(ieee_addr) >= 0;
}

esp_err_t zb_install_codes_get_entry(uint64_t ieee_addr, zb_install_code_entry_t *out_entry)
{
    if (!s_initialized) {
        return ESP_ERR_INVALID_STATE;
    }

    if (out_entry == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    int index = find_entry_index(ieee_addr);
    if (index < 0) {
        return ESP_ERR_NOT_FOUND;
    }

    memcpy(out_entry, &s_install_codes[index], sizeof(zb_install_code_entry_t));
    return ESP_OK;
}

size_t zb_install_codes_list(zb_install_code_entry_t *out_entries, size_t max_entries)
{
    if (!s_initialized) {
        ESP_LOGD(TAG, "Install codes module not initialized");
        return 0;
    }
    if (out_entries == NULL || max_entries == 0) {
        return 0;
    }

    size_t copied = 0;
    for (size_t i = 0; i < ZB_INSTALL_CODE_MAX_ENTRIES && copied < max_entries; i++) {
        if (s_install_codes[i].is_active) {
            memcpy(&out_entries[copied], &s_install_codes[i],
                   sizeof(zb_install_code_entry_t));
            copied++;
        }
    }

    return copied;
}

size_t zb_install_codes_count(void)
{
    if (!s_initialized) {
        ESP_LOGD(TAG, "Install codes module not initialized");
        return 0;
    }
    return s_entry_count;
}

esp_err_t zb_install_codes_clear_all(void)
{
    if (!s_initialized) {
        return ESP_ERR_INVALID_STATE;
    }

    ESP_LOGW(TAG, "Clearing all install codes!");

    /* Clear memory */
    memset(s_install_codes, 0, ZB_INSTALL_CODE_MAX_ENTRIES * sizeof(zb_install_code_entry_t));
    s_entry_count = 0;

    /* Clear NVS */
    nvs_handle_t nvs_handle;
    esp_err_t ret = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (ret == ESP_OK) {
        nvs_erase_all(nvs_handle);
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    }

    ESP_LOGI(TAG, "All install codes cleared");
    return ESP_OK;
}

/* ============================================================================
 * Zigbee Stack Integration
 * ============================================================================ */

esp_err_t zb_install_codes_apply_to_stack(uint64_t ieee_addr)
{
    if (!s_initialized) {
        return ESP_ERR_INVALID_STATE;
    }

    int index = find_entry_index(ieee_addr);
    if (index < 0) {
        return ESP_ERR_NOT_FOUND;
    }

    zb_install_code_entry_t *entry = &s_install_codes[index];

    /* Convert uint64_t to esp_zb_ieee_addr_t (8-byte array, little-endian) */
    esp_zb_ieee_addr_t ieee_array;
    zb_u64_to_ieee(ieee_addr, ieee_array);

    /* Add the link key to the Trust Center for this device */
    esp_err_t ret = esp_zb_secur_ic_add(ieee_array, entry->install_code_len,
                                         entry->install_code);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to add install code to stack: %s", esp_err_to_name(ret));
        return ret;
    }

    ESP_LOGI(TAG, "Applied install code to stack for 0x%016" PRIX64, ieee_addr);
    return ESP_OK;
}

/* ============================================================================
 * Parsing Functions
 * ============================================================================ */

esp_err_t zb_install_codes_parse_ieee(const char *ieee_str, uint64_t *out_addr)
{
    if (ieee_str == NULL || out_addr == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Skip "0x" prefix if present */
    const char *ptr = ieee_str;
    if (ptr[0] == '0' && (ptr[1] == 'x' || ptr[1] == 'X')) {
        ptr += 2;
    }

    /* Parse as hexadecimal */
    char *endptr;
    uint64_t addr = strtoull(ptr, &endptr, 16);

    /* Check for parse errors */
    if (endptr == ptr || (*endptr != '\0' && !isspace((unsigned char)*endptr))) {
        ESP_LOGW(TAG, "Invalid IEEE address format: %s", ieee_str);
        return ESP_ERR_INVALID_ARG;
    }

    *out_addr = addr;
    return ESP_OK;
}

esp_err_t zb_install_codes_parse_code(const char *code_str, uint8_t *out_code,
                                       size_t buf_len, size_t *out_len)
{
    if (code_str == NULL || out_code == NULL || out_len == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    size_t str_len = strlen(code_str);
    size_t byte_count = 0;

    /* Parse hex string, skipping separators like '-', ':', ' ' */
    for (size_t i = 0; i < str_len && byte_count < buf_len; ) {
        /* Skip separators */
        while (i < str_len && (code_str[i] == '-' || code_str[i] == ':' ||
               code_str[i] == ' ' || code_str[i] == '\t')) {
            i++;
        }

        if (i >= str_len) {
            break;
        }

