moag1000/ESP32-c5-Zigbee2ESPHome/main/zigbee/zb_install_codes.c
        /* Parse two hex characters */
        if (i + 1 >= str_len) {
            ESP_LOGW(TAG, "Odd number of hex characters");
            return ESP_ERR_INVALID_ARG;
        }

        char hex[3] = { code_str[i], code_str[i + 1], '\0' };

        if (!isxdigit((unsigned char)hex[0]) || !isxdigit((unsigned char)hex[1])) {
            ESP_LOGW(TAG, "Invalid hex character at position %d", (int)i);
            return ESP_ERR_INVALID_ARG;
        }

        out_code[byte_count++] = (uint8_t)strtol(hex, NULL, 16);
        i += 2;
    }

    *out_len = byte_count;
    return ESP_OK;
}

esp_err_t zb_install_codes_format_code(const uint8_t *install_code, size_t code_len,
                                        char *out_str, size_t str_len)
{
    if (install_code == NULL || out_str == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    if (str_len < code_len * 2 + 1) {
        return ESP_ERR_NO_MEM;
    }

    char *ptr = out_str;
    size_t remaining = str_len;
    for (size_t i = 0; i < code_len && remaining > 2; i++) {
        int written = snprintf(ptr, remaining, "%02X", install_code[i]);
        if (written < 0 || (size_t)written >= remaining) break;
        ptr += written;
        remaining -= written;
    }
    *ptr = '\0';

    return ESP_OK;
}

/* ============================================================================
 * Expired Entry Cleanup
 * ============================================================================ */

size_t zb_install_codes_cleanup_expired(void)
{
    if (!s_initialized) {
        return 0;
    }

    xSemaphoreTake(s_mutex, GW_TIMEOUT_LONG_TICKS);

    size_t removed = 0;
    for (size_t i = 0; i < ZB_INSTALL_CODE_MAX_ENTRIES; i++) {
        if (s_install_codes[i].is_active && is_entry_expired(&s_install_codes[i])) {
            ESP_LOGI(TAG, "Removing expired install code for 0x%016" PRIX64,
                     s_install_codes[i].ieee_addr);
            memset(&s_install_codes[i], 0, sizeof(zb_install_code_entry_t));
            s_entry_count--;
            removed++;
        }
    }

    if (removed > 0) {
        save_to_nvs();
        ESP_LOGI(TAG, "Cleaned up %zu expired install code entries", removed);
    }

    xSemaphoreGive(s_mutex);
    return removed;
}

/* ============================================================================
 * Self-Test Function
 * ============================================================================ */

esp_err_t zb_install_codes_test(void)
{
    ESP_LOGI(TAG, "Running install codes self-test...");

    /* Test CRC calculation with known values */
    /* Example: 48-bit install code: 83 FE D3 40 7A 93 */
    uint8_t test_code_48[] = { 0x83, 0xFE, 0xD3, 0x40, 0x7A, 0x93 };
    uint16_t crc_48 = zb_install_codes_calculate_crc(test_code_48, sizeof(test_code_48));
    ESP_LOGI(TAG, "CRC for 48-bit test code: 0x%04X", crc_48);

    /* Test validation with valid code (including CRC) */
    uint8_t test_code_with_crc[8];
    memcpy(test_code_with_crc, test_code_48, 6);
    test_code_with_crc[6] = (uint8_t)(crc_48 & 0xFF);       /* CRC low byte */
    test_code_with_crc[7] = (uint8_t)((crc_48 >> 8) & 0xFF); /* CRC high byte */

    zb_install_code_status_t status = zb_install_codes_validate(test_code_with_crc, 8);
    if (status != ZB_INSTALL_CODE_STATUS_OK) {
        ESP_LOGE(TAG, "FAILED: Valid code rejected (status=%d)", status);
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "PASSED: Valid code accepted");

    /* Test validation with invalid CRC */
    test_code_with_crc[7] ^= 0xFF; /* Corrupt CRC */
    status = zb_install_codes_validate(test_code_with_crc, 8);
    if (status != ZB_INSTALL_CODE_STATUS_CRC_ERROR) {
        ESP_LOGE(TAG, "FAILED: Invalid CRC not detected (status=%d)", status);
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "PASSED: Invalid CRC detected");

    /* Test key derivation */
    uint8_t derived_key[16];
    test_code_with_crc[7] ^= 0xFF; /* Restore CRC */
    esp_err_t ret = zb_install_codes_derive_key(test_code_with_crc, 8, derived_key);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "FAILED: Key derivation error: %s", esp_err_to_name(ret));
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "PASSED: Key derivation successful");
    ESP_LOGI(TAG, "Derived key: %02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X",
             derived_key[0], derived_key[1], derived_key[2], derived_key[3],
             derived_key[4], derived_key[5], derived_key[6], derived_key[7],
             derived_key[8], derived_key[9], derived_key[10], derived_key[11],
             derived_key[12], derived_key[13], derived_key[14], derived_key[15]);

    /* Test parsing functions */
    uint64_t parsed_ieee;
    ret = zb_install_codes_parse_ieee("0x00124b001234ABCD", &parsed_ieee);
    if (ret != ESP_OK || parsed_ieee != 0x00124b001234ABCDULL) {
        ESP_LOGE(TAG, "FAILED: IEEE parsing error");
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "PASSED: IEEE parsing successful: 0x%016" PRIX64, parsed_ieee);

    /* Test install code parsing */
    uint8_t parsed_code[18];
    size_t parsed_len;
    ret = zb_install_codes_parse_code("83-FE-D3-40-7A-93-AB-CD", parsed_code,
                                       sizeof(parsed_code), &parsed_len);
    if (ret != ESP_OK || parsed_len != 8) {
        ESP_LOGE(TAG, "FAILED: Install code parsing error");
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "PASSED: Install code parsing successful (len=%d)", parsed_len);

    ESP_LOGI(TAG, "Install codes self-test PASSED");
    return ESP_OK;
}
